{
  "HomePage": {
    "heroSubtitle": "portfolio",
    "title": "Hello, I am Vlad Vagin",
    "textHero":"Frontend and MERN-stack Web Developer who specialize in HTML5/CSS3, JavaScript, React.js, Next.js, TypeScript, Node.js, NoSQL/SQL databases, REST APIs and WordPress.",
    "btnAbout":"About",
    "btnDownload":"Download CV",
    "expertise":"my expertise",
    "solutions":"Innovative Solutions",
    "textExpertise":"I specialize in creating dynamic and beautiful web pages and applications. I have extensive experience in developing REST APIs, implementing SEO and Accesibility best practices. My goal is to create efficient, scalable, and user-friendly solutions that meet the needs of users.",
    "webpages":"Web Pages",
    "textWebpages":"Involves creating individual pages that provide information, entertainment, or e-commerce functionality. I ensure that these pages are well-designed, responsive, and optimized for search engines.",
    "textWebapps":"It is about creating applications that run on a web server and can be accessed by users via a web browser. I specialize in creating dynamic, responsive, and user-friendly web applications using modern technologies like JavaScript, TypeScript, React and Next.",
    "textRestApis":"Creating interfaces that allow different software applications to communicate and exchange data. I have experience in designing and implementing secure, efficient, and scalable REST APIs with Node.js.",
    "skills":"my skills",
    "textSkills":"I specialize in JavaScript, TypeScript, React, Next and have experience with backend development using Node.js. I am also proficient in using various development tools such as npm and Git, Redux and Firebase. My focus is on writing clean, efficient, and maintainable code.",
    "featuredWorks": "Featured Works",
    "seeMore":"See More +",
    "shapeAlt":"Shape for decoration",
    "screenAlt":"Screenshot of project",
    "ariaLabelLink":"Link to the project details page",
    "educationSubtitle":"my learning",
    "educationTitle":"Education",
    "educationText":"My education journey has been unique and diverse. I started my career as a seaman, navigating the vast oceans. But my passion for technology and coding led me to the world of web development. Today, I use my diverse experiences to create innovative and user-friendly web solutions.",
    "onma":"National University 'Odessa Maritime Academy'",
    "textOnma":"I received my Master's degree in Navigation from the Odessa Maritime Academy in 2014. This rigorous program provided me with a strong foundation in navigation principles and practices, and instilled in me a deep appreciation for precision and accuracy - qualities that I carry into my work as a web developer.",
    "goit":"GoIT - IT School",
    "textGoit":"Completed 10-months course Fullstack Web Developer in GoIT. I learned to build web applications using a variety of technologies, including HTML, CSS, JavaScript, TypeScript, React, and Node.js. I am excited to continue expanding my skills and knowledge in this field.",
    "getafe":"COE Getafe",
    "textGetafe":"Completed 6-months course Web Pages Development and Publishing in CRN Getafe with 80 hours of internship. I learned to build web pages using a variety of technologies, including HTML, CSS, JavaScript, JQuery, Bootstrap, WordPress, SEO and Accessibility. I am excited to continue expanding my skills and knowledge in this field.",
    "socialMedia":"Social Media",
    "textSocialMedia":"Also You can visit my profiles in some social media like LinkedIn or GitHub, and contact through Telegram.",
    "ariaLabelLinkedIn":"Go to LinkedIn profile",
    "ariaLabelGitHub":"Go to GitHub profile",
    "ariaLabelTelegram":"Go to Telegram profile",
    "contact":"contact",
    "getInTouch":"Get in Touch",
    "textContact":"If you are interested in collaborating, feel free to reach out using this form. I am always open to discussing new projects, creative ideas, or opportunities to be part of your visions.",
    "sendMessageSuccess":"Message sent successfully",
    "sendMessageError":"Failed to send message. Please try again later.",
    "wantCollaboration":"Want a collaboration?",
    "name":"Name",
    "message":"Message",
    "submit":"Submit",
    "submitAriaLabel":"Submit the form and send the message"
  },
  "Header": {
    "main": "Main",
    "about": "About",
    "projects": "Projects",
    "ariaLabelMain":"Go to the main page",
    "ariaLabelAbout":"Go to the about page",
    "ariaLabelProjects":"Go to the projects page",
    "closeModalAriaLabel":"Close the mobile menu"
  },
  "Footer": {
    "slogan":"Crafting Digital Experiences, One Line of Code at a Time.",
    "contactFooter":"Contact",
    "address":"Madrid, Spain",
    "callUs":"Call us at +34 665 051 466",
    "sendEmail":"Send message to my email - vladtwince@gmail.com"
  },
  "AboutMe": {
    "subtitle": "About Me",
    "title":"All About Me",
    "description":"About my skills, my education, my experience, my hobbies and life.",
    "shape":"Shape for decoration",
    "myPhoto":"My photo",
    "skills":"Skills",
    "techSkills":"Tech. Skills:",
    "skillsValues":"HTML5, CSS3, JavaScript, TypeScript, React.js, Redux, Redux Toolkit, Next.js, Tailwind CSS, SCSS, Styled-Components, Framer-motion, Material UI, Sanity, Stripe, Node.js, Express.js, React Native (Expo), SQL/NoSQL databases, Firebase, JQuery, Swagger, WordPress, AWS Cloud, JQuery, i18next, JS/React-libraries.",
    "soft":"Soft:",
    "softValues":"VSCode, Git, GitHub, Figma, Trello, Jira, Slack, Zoom, Postman, Swagger, Squooash, Chrome Devtools, Mongo Atlas, Heroku, Vercel, Netlify",
    "approaches":"Approaches:",
    "approachesValues":"Mobile First, Responsive Design, Cross-browser compatibility, Pixel Perfect, SEO optimization, Accessibility, SCRUM, Agile, JWT-authentication, Animation, REST API.",
    "banner":"Banner from LinkedIn profile",
    "seamanLife":"Seaman Life",
    "textSeaman1":"From 2008 to 2014 I was a student at Odessa National Maritime Academy ( now called National University Odessa Maritime Academy) where I studied to become a marine navigator. During my education I started my seaman&apos;s career on international ships. My first voyage I get in 2011 on bulk carrier like Deck Cadet. In February 2014, I was graduated like Specialist of Navigation (Master's degree).",
    "textSeaman2":"From 2017 I became Third Officer and until August 2022 worked on this position and thought about new opportunities in my life like Web Development.",
    "onmaSymbol":"Symbol of National University Odessa National Maritime Academy",
    "goit":"GoIT - IT School",
    "goitText1":"After start war in Ukraine, I relocated to Spain with family and started to learn Web Development. I get my first certificate in March 2023 and it was AWS Cloud Practitioner Certificate.",
    "goitText2":"After that, I commenced a 10-months course Fullstack Web Developer in GoIT school. During this course I learned HTML5, CSS3, JavaScript, React.js, Redux, TypeScript, Node.js. The most important thing, that we learned the best practices of coding and must modern technologies. I participated in team projects and have numerous individual projects. On our team projects we use Trello, Jira, GitHub and Figma for design. It was so great experience that 10-months course I completed in 6 months.",
    "goitText3":"Also, during my education I participated in DrukArmy team project. We update the frontend part of existing project by using Next.js. It was very useful experience, because I started work with Next.js, learned how to implement i18next for localization, how customise input for all types of browser and how work with hard layout.",
    "certPage1":"Fullstack Web Developer Certificate first page",
    "certPage2":"Fullstack Web Developer Certificate second page",
    "certPage3":"Fullstack Web Developer Certificate third page",
    "certPage4":"Fullstack Web Developer Certificate fourth page",
    "getafe":"COE Getafe",
    "getafeText1":"After my relocation to Spain, I started learn Spanish, and started course Web Page Development and Publishing in Center of Education in Getafe. During this course I learned HTML5, CSS3, JavaScript, JQuery, Boostrap, WordPress ( Elementor, WooCommerce), SEO optimization and Accessibility. After completion of this course I have got 80 hours (3 weeks) internship in ONG Remar Spain.",
    "getafeText2":"The first time I worked with WordPress, optimized website for SEO, fixed CSS and JS bugs. When my tutor saw that I can create web applications, he ask me to create a web application for Solidaria Media. I choose Next.js for this project. I created this app for streaming radio and TV with admin dashboard. Admin can manage YouTube videos in this application, add or delete them.",
    "getafeText3":"After successful completion of this internship, I obtained a proffesional certificate and Medium Grade in Spain.",
    "searchJob":"Job's Search",
    "searchJobText1":"After completion courses in GoIT and CRN Getafe, I continued to learn new technologies and improve my skills. I learned React Native, SQL databases, Sanity and Stripe integrations, improve TypeScript and for this moment I am learning AI in Web Development. My education will never stop, even if I get a job.",
    "searchJobText2":"Due to above mentioned, I am looking for a job as a Junior (Strong Junior) Web Developer. I am ready to work in a team, learn new and improve my skills. I am looking for a company where I can grow and develop my skills. I am looking for a company where I can be a part of a team, work on interesting projects and I am interesting in long term cooperation. Also, I am ready to relocate to any city within Spain.",
    "hobby":"My Hobbies",
    "hobbyText":"My main hobby, of course, its coding. But, also, I like a lot hiking and playing the guitar. I like to spend time in the nature, far from the city noise. I have been playing the guitar more than 10 years. I like to play the guitar, because it helps me to relax and forget about all problems.",
    "hobbyPhotoAlt":"Mountains of Guadarrama"
  },
  "Projects": {
    "subtitle":"portfolio",
    "title":"My Projects",
    "text":"There are different types of web projects, from simple landing page and galleries of images to fullstack web applications with REST APIs servers.",
    "shape":"Shape for decoration",
    "imgAlt":"Web Developing of projects",
    "seeDetails":"See Details",
    "btnAriaLabel":"Go to details of project"
  }
}
