{
  "HomePage": {
    "heroSubtitle": "portfolio",
    "title": "Hello, I am Vlad Vagin",
    "textHero":"Frontend and MERN-stack Web Developer who specialize in HTML5/CSS3, JavaScript, React.js, Next.js, TypeScript, Node.js, NoSQL/SQL databases, REST APIs and WordPress.",
    "btnAbout":"About",
    "btnDownload":"Download CV",
    "expertise":"my expertise",
    "solutions":"Innovative Solutions",
    "textExpertise":"I specialize in creating dynamic and beautiful web pages and applications. I have extensive experience in developing REST APIs, implementing SEO and Accesibility best practices. My goal is to create efficient, scalable, and user-friendly solutions that meet the needs of users.",
    "webpages":"Web Pages",
    "textWebpages":"Involves creating individual pages that provide information, entertainment, or e-commerce functionality. I ensure that these pages are well-designed, responsive, and optimized for search engines.",
    "textWebapps":"It is about creating applications that run on a web server and can be accessed by users via a web browser. I specialize in creating dynamic, responsive, and user-friendly web applications using modern technologies like JavaScript, TypeScript, React and Next.",
    "textRestApis":"Creating interfaces that allow different software applications to communicate and exchange data. I have experience in designing and implementing secure, efficient, and scalable REST APIs with Node.js.",
    "skills":"my skills",
    "whatSkills":"Frontend, Backend and Software",
    "textSkills":"I specialize in JavaScript, TypeScript, React, Next and have experience with backend development using Node.js. I am also proficient in using various development tools such as npm and Git, Redux and Firebase. My focus is on writing clean, efficient, and maintainable code.",
    "featuredWorks": "Featured Works",
    "seeMore":"See More +",
    "shapeAlt":"Shape for decoration",
    "screenAlt":"Screenshot of project",
    "ariaLabelLink":"Link to the project details page",
    "educationSubtitle":"my learning",
    "educationTitle":"Education",
    "educationText":"My education journey has been unique and diverse. I started my career as a seaman, navigating the vast oceans. But my passion for technology and coding led me to the world of web development. Today, I use my diverse experiences to create innovative and user-friendly web solutions.",
    "onma":"National University 'Odessa Maritime Academy'",
    "textOnma":"I received my Master's degree in Navigation from the Odessa Maritime Academy in 2014. This rigorous program provided me with a strong foundation in navigation principles and practices, and instilled in me a deep appreciation for precision and accuracy - qualities that I carry into my work as a web developer.",
    "goit":"GoIT - IT School",
    "textGoit":"Completed 10-months course Fullstack Web Developer in GoIT. I learned to build web applications using a variety of technologies, including HTML, CSS, JavaScript, TypeScript, React, and Node.js. I am excited to continue expanding my skills and knowledge in this field.",
    "getafe":"COE Getafe",
    "textGetafe":"Completed 6-months course Web Pages Development and Publishing in CRN Getafe with 80 hours of internship. I learned to build web pages using a variety of technologies, including HTML, CSS, JavaScript, JQuery, Bootstrap, WordPress, SEO and Accessibility. I am excited to continue expanding my skills and knowledge in this field.",
    "socialMedia":"Social Media",
    "textSocialMedia":"Also You can visit my profiles in some social media like LinkedIn or GitHub, and contact through Telegram.",
    "ariaLabelLinkedIn":"Go to LinkedIn profile",
    "ariaLabelGitHub":"Go to GitHub profile",
    "ariaLabelTelegram":"Go to Telegram profile",
    "contact":"contact",
    "getInTouch":"Get in Touch",
    "textContact":"If you are interested in collaborating, feel free to reach out using this form. I am always open to discussing new projects, creative ideas, or opportunities to be part of your visions.",
    "sendMessageSuccess":"Message sent successfully",
    "sendMessageError":"Failed to send message. Please try again later.",
    "wantCollaboration":"Want a collaboration?",
    "name":"Name",
    "message":"Message",
    "submit":"Submit",
    "submitAriaLabel":"Submit the form and send the message"
  },
  "Header": {
    "main": "Main",
    "about": "About",
    "projects": "Projects",
    "ariaLabelMain":"Go to the main page",
    "ariaLabelAbout":"Go to the about page",
    "ariaLabelProjects":"Go to the projects page",
    "closeModalAriaLabel":"Close the mobile menu",
    "notFound":"Not Found",
    "goMain":"Go to the main page"
  },
  "Footer": {
    "slogan":"Crafting Digital Experiences, One Line of Code at a Time.",
    "contactFooter":"Contact",
    "address":"Madrid, Spain",
    "callUs":"Call us at +34 665 051 466",
    "sendEmail":"Send message to my email - vladtwince@gmail.com"
  },
  "AboutMe": {
    "subtitle": "About Me",
    "title":"All About Me",
    "description":"About my skills, my education, my experience, my hobbies and life.",
    "shape":"Shape for decoration",
    "myPhoto":"My photo",
    "skills":"Skills",
    "techSkills":"Tech. Skills:",
    "skillsValues":"HTML5, CSS3, JavaScript, TypeScript, React.js, Redux, Redux Toolkit, Next.js, Tailwind CSS, SCSS, Styled-Components, Framer-motion, Material UI, Sanity, Stripe, Node.js, Express.js, React Native (Expo), SQL/NoSQL databases, Firebase, JQuery, Swagger, WordPress, AWS Cloud, JQuery, i18next, JS/React-libraries.",
    "soft":"Soft:",
    "softValues":"VSCode, Git, GitHub, Figma, Trello, Jira, Slack, Zoom, Postman, Swagger, Squooash, Chrome Devtools, Mongo Atlas, Heroku, Vercel, Netlify",
    "approaches":"Approaches:",
    "approachesValues":"Mobile First, Responsive Design, Cross-browser compatibility, Pixel Perfect, SEO optimization, Accessibility, SCRUM, Agile, JWT-authentication, Animation, REST API.",
    "banner":"Banner from LinkedIn profile",
    "seamanLife":"Seaman Life",
    "textSeaman1":"From 2008 to 2014 I was a student at Odessa National Maritime Academy ( now called National University Odessa Maritime Academy) where I studied to become a marine navigator. During my education I started my seaman&apos;s career on international ships. My first voyage I get in 2011 on bulk carrier like Deck Cadet. In February 2014, I was graduated like Specialist of Navigation (Master's degree).",
    "textSeaman2":"From 2017 I became Third Officer and until August 2022 worked on this position and thought about new opportunities in my life like Web Development.",
    "onmaSymbol":"Symbol of National University Odessa National Maritime Academy",
    "goit":"GoIT",
    "goitText1":"After start war in Ukraine, I relocated to Spain with family and started to learn Web Development. I get my first certificate in March 2023 and it was AWS Cloud Practitioner Certificate.",
    "goitText2":"After that, I commenced a 10-months course Fullstack Web Developer in GoIT school. During this course I learned HTML5, CSS3, JavaScript, React.js, Redux, TypeScript, Node.js. The most important thing, that we learned the best practices of coding and must modern technologies. I participated in team projects and have numerous individual projects. On our team projects we use Trello, Jira, GitHub and Figma for design. It was so great experience that 10-months course I completed in 6 months.",
    "goitText3":"Also, during my education I participated in DrukArmy team project. We update the frontend part of existing project by using Next.js. It was very useful experience, because I started work with Next.js, learned how to implement i18next for localization, how customise input for all types of browser and how work with hard layout.",
    "certPage1":"Fullstack Web Developer Certificate first page",
    "certPage2":"Fullstack Web Developer Certificate second page",
    "certPage3":"Fullstack Web Developer Certificate third page",
    "certPage4":"Fullstack Web Developer Certificate fourth page",
    "getafe":"COE Getafe",
    "getafeText1":"After my relocation to Spain, I started learn Spanish, and started course Web Page Development and Publishing in Center of Education in Getafe. During this course I learned HTML5, CSS3, JavaScript, JQuery, Boostrap, WordPress ( Elementor, WooCommerce), SEO optimization and Accessibility. After completion of this course I have got 80 hours (3 weeks) internship in ONG Remar Spain.",
    "getafeText2":"The first time I worked with WordPress, optimized website for SEO, fixed CSS and JS bugs. When my tutor saw that I can create web applications, he ask me to create a web application for Solidaria Media. I choose Next.js for this project. I created this app for streaming radio and TV with admin dashboard. Admin can manage YouTube videos in this application, add or delete them.",
    "getafeText3":"After successful completion of this internship, I obtained a proffesional certificate and Medium Grade in Spain.",
    "searchJob":"Looking for",
    "searchJobText1":"After completion courses in GoIT and CRN Getafe, I continued to learn new technologies and improve my skills. I learned React Native, SQL databases, Sanity and Stripe integrations, improve TypeScript and for this moment I am learning AI in Web Development. My education will never stop, even if I get a job.",
    "searchJobText2":"Due to above mentioned, I am looking for a job as a Junior (Strong Junior) Web Developer. I am ready to work in a team, learn new and improve my skills. I am looking for a company where I can grow and develop my skills. I am looking for a company where I can be a part of a team, work on interesting projects and I am interesting in long term cooperation. Also, I am ready to relocate to any city within Spain.",
    "hobby":"My Hobbies",
    "hobbyText":"My main hobby, of course, its coding. But, also, I like a lot hiking and playing the guitar. I like to spend time in the nature, far from the city noise. I have been playing the guitar more than 10 years. I like to play the guitar, because it helps me to relax and forget about all problems.",
    "hobbyPhotoAlt":"Mountains of Guadarrama"
  },
  "Projects": {
    "details":"Details",
    "skills":"Skills",
    "approaches":"Approaches",
    "description":"Description",
    "repo":"Repository",
    "type":"Type:",
    "subtitle":"portfolio",
    "title":"My Projects",
    "text":"There are different types of web projects, from simple landing page and galleries of images to fullstack web applications with REST APIs servers.",
    "shape":"Shape for decoration",
    "imgAlt":"Web Developing of projects",
    "seeDetails":"See Details",
    "seeMore":"See More +",
    "btnAriaLabel":"Go to details of project",
    "petloveDescription":"An application for searching a new house for pets and for people who looking for a new cute friend in their life. App consist of 6 public pages, 2 private pages (with two sub pages Favorites and Viewed) and pages for login and registration users. The app has a responsive design and is optimized for mobile devices. The app uses REST API for fetching data from the server. User can filter pets by keyword, type, gender, location, category, popularity and price. He/She can add pets to favorites and view them later, contact with owner and create pet card by himself/herself.",
    "petloveDetails":"Individual frontend project on React and REST APIs. The app has a responsive design and is optimized for mobile devices. The app uses JWT tokens for authentication. User can login and change avatar or user's info. Also when user authorized he can create pet card, add to favourites and contactn with pet's owner. This application has Splash screen also. For DatePicker I use Material UI library, for input-select I use React-Select library. Also there filter for pets by keyword, category, type, location, gender, popularity and price. All images have webp format for optimization. For form validation I use Formik, React-Hook-Form and Yup libraries due to technical requirements. For notifications I use React-toastify library. For fetching data from server I use Axios library. For styling I use Styled-components library. For state management I use Redux Toolkit library. For persisting state I use Redux Persist library. On News page user can read news about animals and filter them by keyword.",
    "lingoDescription":"An application for a company that offers the services of language teachers online. After login user can contact with teacher and add him to favorites. User can filter teachers by language, price and level of knowledge. User can also view the teacher's profile and see his/her rating, price, availability, languages, and description.",
    "lingoDetails":"Individual fullstack project on React and Firebase. The app has a responsive design, is optimized for mobile devices and uses Firebase-Auth and Real-Time DataBase. User can change accent-color and choose what he like. For contact with teacher and/or add to Favorites user should login to app. Web application use CSS-animation, Pagination and Filtering by price, by language and by level.",
    "ecoSolutionDescription":"A landing page for a company that offers eco-friendly solutions. The app has a responsive design and is optimized for mobile devices.",
    "ecoSolutionDetails":"Individual landing project on React.js. It was Test Task which I passed. This landing use react-scroll library for navigation and framer-motion for animation. This landing has custom slider and form validation. For Form validation I use react-hook-form and Yup library. For styling I use Styled-Components.",
    "epharmDescription":"Admin dashboard for e-pharmacy shops. Admin should login first and after that, he can check all data, create new product, supplier, edit them, delete and filter.",
    "epharmDetails":"Individual fullstack project on React.js and REST API (Node.js, Express.js, MongoDB). This is admin dashboard for some farmacy with statistic, customers info, suppliers, orders and products. There are filter, pagination and horizontal scroll for tables. For authentification of admin I use JWT-tokens.",
    "apiPharmDescription":"Backend for admin e-pharmacy project. Has JWT - authentification with private routes and Swagger documentation.",
    "apiPharmDetails":"This backend project is a part of individual fullstack project E-Pharmacy. Backend has routes for get and edit information about customers, products, orders and suppliers. Use bcrypt for hashing the password. For validation of data I use Joi library. For authentification I use JWT-tokens. For documentation I use Swagger. DataBase MongoDB.",
    "solidariaDescription":"Application for streaming radio and TV for ONG Remar Spain. Admin can add or delete last videos from YouTube channels of Solidaria Media. Backend and Frontend created with Next.js.",
    "solidariaDetails":"Individual fullstack project on Next.js and MongoDB database. Free design, free structure. This application was created during my internship, specially for ONG REMAR SPAIN for streaming radio and TV. Also there are last videos form Solidaria Media YouTube channels. Admin can add new videos or delete old videos from application. For API I use SSC of Next.js and Credentials Provider.",
    "drukarmyDescription":"Redesign of the existing website for the volunteer Ukrainian organization DrukArmy.",
    "drukarmyDetails":"DrukArmy - is a famous Ukrainian volunteer project. It was Team Frontend project for redesign frontend part of existing web app. We use Next.js for make the best SEO. For styling we use CSS-modules. My sections: Header, Footer, Main page, Terms page, 404 Not Found Page, Loader, Switcher Dark/Light, Internalization with i18next, Mobile menu and all modals on Main page.",
    "drinkFrontDescription":"DrinkMaster is a cocktail recipe app. User should register and login first. After he can add cocktails to favorites and create customs drinks. Also user can change avatar and some user information. Mu section: Header, Mobile menu, Switcher dark/light, Navigation, Popular drinks, User menu, Update user modal with form.",
    "drinkFrontDetails":"Team Fullstack Project on React.js and Node.js. The app has a responsive dersign and is optimized for mobile devices. My section: Header, Mobile menu, Switcher Dark/Light, Popular Drinks, User Profile Menu, Modal with Update user form, on Backend routes for Popular drinks, Update user and Swagger documentation for them. We ccreated Backend first and then Frontend part. User can change avatar, create custom drinks, add to Favorites and Remove from favorites. There filtering, pagination and custom cursor. For authentification we use JWT-tokens and Email-verification.",
    "apiDrinkDescription":"Backend for DrinkMaster project. Has JWT - authentification with private routes and Swagger documentation.",
    "apiDrinkDetails":"Backend for DrinkMaster team project. My sections on backend was: get Popular Drinks route, update User route ( change avatar, info) and Swagger documentation for these routes.",
    "bookshelfDescription":"Bookshelf is a website for book lovers. User can also add books to favorites and view them later. The app uses Firebase for authentication and storing data. My sections: Header, Bestsellers Books, Firebase-authentication, Pagination, Switcher dark/light, Categories list.",
    "bookshelfDetails":"Team Frontend project on Vanilla JavaScript with Firebase Authentication. My sections were: Bestesellers books, Categories books, Header, Switcher Dark/Light, Mobile menu, Firebase authentication and Delete books from Favorites. For this Team project we use Vite bundler. There are also Pagination and Filtering by categories. For styling we use CSS3. For BookDetails modal we use Simplelightbox library.",
    "energyDescription":"Application for training exercises. User can filter exercises by category, level, and equipment. User can also view the exercise details and add it to favorites.",
    "energyDetails":"Individual frontend project on Vanilla JavaScrip and REST API. User can filter exercises by keyword. User can view exercise details and add it to favorites. For this project I use Parcel bundler. There are Pagination and Filtering by category, level and equipment. For styling I use CSS3.",
    "hotelDescription":"Hotel management system with admin panel in Sanity studio. Admin can add, edit, delete rooms, view bookings, view statistics, and manage users, bookings, rooms, reviews. User can book a room, view booking details, pay for the room, make review of room and check statistics in user menu.",
    "hotelDetails":"Individual fullstack project on Next.js, TypeScript, Stripe and Tailwind CSS. For admin dashboard I used Sanity Studio. User can login with Google, Github or Credentials and books a room within choosen dates. user can make payment by card, make review and check statistic from User Profile. Also there is a Dark/Light switcher. From Sanity Studio admin can add room, manage room, users, bookings and reviews. Admin can view statistics of bookings and reviews.",
    "focusDescription":"Landing page for a school of photography Focus.Frame.",
    "focusDetails":"Team Landing Project for HTML/CSS course. My sections: Hero, About, Advertisement, Mobile menu, Footer. Semanthic HTML, SVG-sprites, Form validation, Slider, Animation exist in this project. Focus.Frame - is a school of photography.",
    "webstudioDescription":"Landing page of Web Studio. Individual project of HTML/CSS course.",
    "webstudioDetails":"Individual project of HTML/CSS course. Have sliders, order form and card's overlay. All project was created with HTML5, CSS3 and JavaScript for modals.",
    "chocoDescription":"Landing page of Simply Chocolate. Individual project of HTML/CSS course. Have sliders, form review and imitation of shopping cart.",
    "chocoDetails":"Individual landing project of HTML/CSS course. Have sliders, form review and imitation of shopping cart. All project was created with HTML5, CSS3 and JavaScript for modals, shopping card and animation."
  }
}
