{
  "HomePage": {
    "heroSubtitle": "portafolio",
    "title": "Hola, Soy Vlad Vagin",
    "textHero": "Desarrollador web frontend y MERN-stack especializado en HTML5/CSS3, JavaScript, React.js, Next.js, TypeScript, Node.js, bases de datos NoSQL/SQL, APIs REST y WordPress.",
    "btnAbout": "Sobre mi",
    "btnDownload": "Descargar CV",
    "expertise": "Mi especialidad",
    "solutions": "Soluciones Innovadoras",
    "textExpertise": "Me especializo en crear páginas web y aplicaciones dinámicas y atractivas. Tengo amplia experiencia en el desarrollo de APIs REST, implementando las mejores prácticas de SEO y accesibilidad. Mi objetivo es crear soluciones eficientes, escalables y fáciles de usar que satisfagan las necesidades de los usuarios.",
    "webpages": "Sitios Web",
    "textWebpages": "Implica crear páginas individuales que proporcionen información, entretenimiento o funcionalidad de comercio electrónico. Me aseguro de que estas páginas estén bien diseñadas, sean responsivas y estén optimizadas para motores de búsqueda.",
    "textWebapps": "Se trata de crear aplicaciones que se ejecutan en un servidor web y a las que los usuarios pueden acceder a través de un navegador web. Me especializo en crear aplicaciones web dinámicas, responsivas y fáciles de usar utilizando tecnologías modernas como JavaScript, TypeScript, React y Next.",
    "textRestApis": "Crear interfaces que permiten a diferentes aplicaciones de software comunicarse e intercambiar datos. Tengo experiencia en el diseño e implementación de APIs REST seguras, eficientes y escalables con Node.js",
    "skills": "Mis habilidades",
    "textSkills": "Me especializo en JavaScript, TypeScript, React, Next y tengo experiencia en desarrollo backend con Node.js. También soy competente en el uso de varias herramientas de desarrollo, como npm y Git, Redux y Firebase. Mi enfoque está en escribir código limpio, eficiente y mantenible.",
    "featuredWorks": "Trabajos Destacados",
    "seeMore": "Ver Más +",
    "shapeAlt": "Forma para decoración",
    "screenAlt": "Captura de pantalla del proyecto",
    "ariaLabelLink": "Enlace a la página de detalles del proyecto",
    "educationSubtitle": "mi aprendizaje",
    "educationTitle": "Formación",
    "educationText": "Mi trayectoria educativa ha sido única y diversa. Comencé mi carrera como marinero, navegando por los vastos océanos. Sin embargo, mi pasión por la tecnología y la programación me llevó al mundo del desarrollo web. Hoy en día, utilizo mis diversas experiencias para crear soluciones web innovadoras y fáciles de usar",
    "onma": "Universidad Nacional 'Academia Marítima de Odesa'",
    "textOnma": "Recibí mi Maestría en Navegación de la Academia Marítima de Odesa en 2014. Este riguroso programa me proporcionó una sólida base en principios y prácticas de navegación, y me inculcó una profunda apreciación por la precisión y la exactitud, cualidades que aplico en mi trabajo como desarrollador web.",
    "goit": "GoIT - Escuela de TI",
    "textGoit": "Completé un curso de 10 meses de Desarrollador Web Fullstack en GoIT. Aprendí a construir aplicaciones web utilizando una variedad de tecnologías, incluyendo HTML, CSS, JavaScript, TypeScript, React y Node.js. Estoy entusiasmado por seguir ampliando mis habilidades y conocimientos en este campo.",
    "getafe": "CRN Getafe",
    "textGetafe": "Completé un curso de 6 meses en Confección y Publicación de Páginas Web en CRN Getafe, con 80 horas de prácticas. Aprendí a construir páginas web utilizando una variedad de tecnologías, incluyendo HTML, CSS, JavaScript, JQuery, Bootstrap, WordPress, SEO y Accesibilidad. Estoy entusiasmado por seguir ampliando mis habilidades y conocimientos en este campo.",
    "socialMedia": "Redes Sociales",
    "textSocialMedia": "También puedes visitar mis perfiles en redes sociales como LinkedIn o GitHub, y contactarme a través de Telegram.",
    "ariaLabelLinkedIn": "Ir al perfil de LinkedIn",
    "ariaLabelGitHub": "Ir al perfil de GitHub",
    "ariaLabelTelegram": "Ir al perfil de Telegram",
    "contact": "contacto",
    "getInTouch": "Ponte en contacto",
    "textContact": "Si estás interesado en colaborar, no dudes en ponerte en contacto a través de este formulario. Siempre estoy dispuesto a discutir nuevos proyectos, ideas creativas u oportunidades para formar parte de tus visiones.",
    "sendMessageSuccess": "Mensaje enviado con éxito",
    "sendMessageError": "No se pudo enviar el mensaje. Por favor, inténtalo de nuevo más tarde.",
    "wantCollaboration": "¿Quieres colaborar?",
    "name": "Nombre",
    "message": "Mensaje",
    "submit": "Enviar",
    "submitAriaLabel": "Envía el formulario y el mensaje."
  },
  "Header": {
    "main": "Principal",
    "about": "Sobre mi",
    "projects": "Proyectos",
    "ariaLabelMain": "Ir a la página principal",
    "ariaLabelAbout": "Ir a la página de información / sobre mí",
    "ariaLabelProjects": "Ir a la página de proyectos",
    "closeModalAriaLabel": "Cerrar el menú móvil"
  },
  "Footer": {
    "slogan": "Creando experiencias digitales, una línea de código a la vez.",
    "contactFooter": "Contacto",
    "address": "Madrid, España",
    "callUs": "Llámanos al +34 665 051 466",
    "sendEmail": "Envía un mensaje a mi correo electrónico: vladtwince@gmail.com"
  },
  "AboutMe": {
    "subtitle": "Sobre Mí",
    "title": "Todo Sobre Mí",
    "description": "Sobre mis habilidades, mi formación, mi experiencia, mis pasatiempos y mi vida.",
    "shape": "Forma para decoración",
    "myPhoto": "Mi foto",
    "skills": "Habilidades",
    "techSkills": "Habilidades Técnicas:",
    "skillsValues": "HTML5, CSS3, JavaScript, TypeScript, React.js, Redux, Redux Toolkit, Next.js, Tailwind CSS, SCSS, Styled-Components, Framer-motion, Material UI, Sanity, Stripe, Node.js, Express.js, React Native (Expo), bases de datos SQL/NoSQL, Firebase, JQuery, Swagger, WordPress, AWS Cloud, i18next, y bibliotecas JS/React.",
    "soft": "Soft:",
    "softValues": "VSCode, Git, GitHub, Figma, Trello, Jira, Slack, Zoom, Postman, Swagger, Squooash, Chrome Devtools, Mongo Atlas, Heroku, Vercel, Netlify",
    "approaches": "Enfoques:",
    "approachesValues": "Mobile First, Diseño Responsivo, Compatibilidad entre navegadores, Pixel Perfect, Optimización SEO, Accesibilidad, SCRUM, Agile, Autenticación JWT, Animación, REST API.",
    "banner": "Banner de mi perfil de LinkedIn",
    "seamanLife": "Marinero",
    "textSeaman1": "Desde 2008 hasta 2014 fui estudiante en la Academia Nacional Marítima de Odesa (ahora llamada Universidad Nacional Academia Marítima de Odesa), donde estudié para convertirme en navegante marítimo. Durante mi formación, comencé mi carrera como marinero en barcos internacionales. Mi primer viaje lo realicé en 2011 en un carguero como Cadete de Cubierta. En febrero de 2014, me gradué como Especialista en Navegación (Máster).",
    "textSeaman2": "Desde 2017, me convertí en Tercer Oficial y hasta agosto de 2022 trabajé en esa posición, mientras pensaba en nuevas oportunidades en mi vida, como el Desarrollo Web.",
    "onmaSymbol": "Símbolo de la Universidad Nacional Academia Marítima de Odesa",
    "goit": "GoIT - Escuela de TI",
    "goitText1": "Después del inicio de la guerra en Ucrania, me trasladé a España con mi familia y comencé a aprender Desarrollo Web. Obtengo mi primer certificado en marzo de 2023 y fue el Certificado de AWS Cloud Practitioner.",
    "goitText2": "Después de eso, comencé un curso de 10 meses de Desarrollador Web Fullstack en la escuela GoIT. Durante este curso aprendí HTML5, CSS3, JavaScript, React.js, Redux, TypeScript y Node.js. Lo más importante es que aprendimos las mejores prácticas de codificación y las tecnologías más modernas. Participé en proyectos en equipo y en numerosos proyectos individuales. En nuestros proyectos en equipo utilizamos Trello, Jira, GitHub y Figma para el diseño. Fue una experiencia tan genial que completé el curso de 10 meses en 6 meses.",
    "goitText3": "También, durante mi educación, participé en el proyecto en equipo DrukArmy. Actualizamos la parte frontal de un proyecto existente utilizando Next.js. Fue una experiencia muy útil, ya que empecé a trabajar con Next.js, aprendí a implementar i18next para la localización, cómo personalizar los campos de entrada para todos los tipos de navegador y cómo trabajar con diseños complejos.",
    "certPage1": "Primera página del Certificado de Desarrollador Web Fullstack",
    "certPage2": "Segunda página del Certificado de Desarrollador Web Fullstack",
    "certPage3": "Tercera página del Certificado de Desarrollador Web Fullstack",
    "certPage4": "Cuarta página del Certificado de Desarrollador Web Fullstack",
    "getafe": "CRN Getafe",
    "getafeText1": "Después de mi traslado a España, comencé a aprender español y empecé un curso de Desarrollo y Publicación de Páginas Web en el Centro de Educación de Getafe. Durante este curso, aprendí HTML5, CSS3, JavaScript, JQuery, Bootstrap, WordPress (Elementor, WooCommerce), optimización SEO y accesibilidad. Tras completar este curso, realicé una pasantía de 80 horas (3 semanas) en la ONG Remar España.",
    "getafeText2": "La primera vez que trabajé con WordPress, optimicé el sitio web para SEO y solucioné errores de CSS y JS. Cuando mi tutor vio que podía crear aplicaciones web, me pidió que desarrollara una aplicación web para Solidaria Media. Elegí Next.js para este proyecto. Creé esta aplicación para la transmisión de radio y televisión con un panel de administración. El administrador puede gestionar los videos de YouTube en esta aplicación, añadiéndolos o eliminándolos.",
    "getafeText3": "Tras la finalización exitosa de esta pasantía, obtuve un certificado profesional y una calificación media en España.",
    "searchJob": "Búsqueda de empleo",
    "searchJobText1": "Después de completar los cursos en GoIT y CRN Getafe, continué aprendiendo nuevas tecnologías y mejorando mis habilidades. Aprendí React Native, bases de datos SQL, integraciones con Sanity y Stripe, mejoré TypeScript y, en este momento, estoy aprendiendo IA en Desarrollo Web. Mi educación nunca se detendrá, incluso si consigo un empleo.",
    "searchJobText2": "Debido a lo mencionado anteriormente, estoy buscando un empleo como Desarrollador Web Junior (Junior Fuerte). Estoy dispuesto a trabajar en equipo, aprender cosas nuevas y mejorar mis habilidades. Busco una empresa donde pueda crecer y desarrollar mis habilidades. Estoy interesado en formar parte de un equipo, trabajar en proyectos interesantes y en una cooperación a largo plazo. Además, estoy dispuesto a trasladarme a cualquier ciudad dentro de España.",
    "hobby": "Pasatiempos",
    "hobbyText": "Mi principal pasatiempo, por supuesto, es la programación. Pero también me gusta mucho hacer senderismo y tocar la guitarra. Me gusta pasar tiempo en la naturaleza, lejos del ruido de la ciudad. He estado tocando la guitarra durante más de 10 años. Me gusta tocar la guitarra porque me ayuda a relajarme y a olvidar todos los problemas.",
    "hobbyPhotoAlt": "Sierra de Guadarrama"
  },
  "Projects": {
    "subtitle": "portafolio",
    "title": "Mis Proyectos",
    "text": "Hay diferentes tipos de proyectos web, desde páginas de aterrizaje simples y galerías de imágenes hasta aplicaciones web completas con servidores de APIs REST.",
    "shape": "Forma para decoración",
    "imgAlt": "Desarrollo web de proyectos",
    "seeDetails":"Ver detalles",
    "btnAriaLabel":"Ir a los detalles del proyecto"
  }
}
