{
  "HomePage": {
    "heroSubtitle": "portafolio",
    "title": "Hola, Soy Vlad Vagin",
    "textHero": "Desarrollador web frontend y MERN-stack especializado en HTML5/CSS3, JavaScript, React.js, Next.js, TypeScript, Node.js, bases de datos NoSQL/SQL, APIs REST y WordPress.",
    "btnAbout": "Sobre mi",
    "btnDownload": "Descargar CV",
    "expertise": "Mi especialidad",
    "solutions": "Soluciones Innovadoras",
    "textExpertise": "Me especializo en crear páginas web y aplicaciones dinámicas y atractivas. Tengo amplia experiencia en el desarrollo de APIs REST, implementando las mejores prácticas de SEO y accesibilidad. Mi objetivo es crear soluciones eficientes, escalables y fáciles de usar que satisfagan las necesidades de los usuarios.",
    "webpages": "Sitios Web",
    "textWebpages": "Implica crear páginas individuales que proporcionen información, entretenimiento o funcionalidad de comercio electrónico. Me aseguro de que estas páginas estén bien diseñadas, sean responsivas y estén optimizadas para motores de búsqueda.",
    "textWebapps": "Se trata de crear aplicaciones que se ejecutan en un servidor web y a las que los usuarios pueden acceder a través de un navegador web. Me especializo en crear aplicaciones web dinámicas, responsivas y fáciles de usar utilizando tecnologías modernas como JavaScript, TypeScript, React y Next.",
    "textRestApis": "Crear interfaces que permiten a diferentes aplicaciones de software comunicarse e intercambiar datos. Tengo experiencia en el diseño e implementación de APIs REST seguras, eficientes y escalables con Node.js",
    "skills": "Mis habilidades",
    "textSkills": "Me especializo en JavaScript, TypeScript, React, Next y tengo experiencia en desarrollo backend con Node.js. También soy competente en el uso de varias herramientas de desarrollo, como npm y Git, Redux y Firebase. Mi enfoque está en escribir código limpio, eficiente y mantenible.",
    "featuredWorks": "Trabajos Destacados",
    "seeMore": "Ver Más +",
    "shapeAlt": "Forma para decoración",
    "screenAlt": "Captura de pantalla del proyecto",
    "ariaLabelLink": "Enlace a la página de detalles del proyecto",
    "educationSubtitle": "mi aprendizaje",
    "educationTitle": "Formación",
    "educationText": "Mi trayectoria educativa ha sido única y diversa. Comencé mi carrera como marinero, navegando por los vastos océanos. Sin embargo, mi pasión por la tecnología y la programación me llevó al mundo del desarrollo web. Hoy en día, utilizo mis diversas experiencias para crear soluciones web innovadoras y fáciles de usar",
    "onma": "Universidad Nacional 'Academia Marítima de Odesa'",
    "textOnma": "Recibí mi Maestría en Navegación de la Academia Marítima de Odesa en 2014. Este riguroso programa me proporcionó una sólida base en principios y prácticas de navegación, y me inculcó una profunda apreciación por la precisión y la exactitud, cualidades que aplico en mi trabajo como desarrollador web.",
    "goit": "GoIT - Escuela de TI",
    "textGoit": "Completé un curso de 10 meses de Desarrollador Web Fullstack en GoIT. Aprendí a construir aplicaciones web utilizando una variedad de tecnologías, incluyendo HTML, CSS, JavaScript, TypeScript, React y Node.js. Estoy entusiasmado por seguir ampliando mis habilidades y conocimientos en este campo.",
    "getafe": "CRN Getafe",
    "textGetafe": "Completé un curso de 6 meses en Confección y Publicación de Páginas Web en CRN Getafe, con 80 horas de prácticas. Aprendí a construir páginas web utilizando una variedad de tecnologías, incluyendo HTML, CSS, JavaScript, JQuery, Bootstrap, WordPress, SEO y Accesibilidad. Estoy entusiasmado por seguir ampliando mis habilidades y conocimientos en este campo.",
    "socialMedia": "Redes Sociales",
    "textSocialMedia": "También puedes visitar mis perfiles en redes sociales como LinkedIn o GitHub, y contactarme a través de Telegram.",
    "ariaLabelLinkedIn": "Ir al perfil de LinkedIn",
    "ariaLabelGitHub": "Ir al perfil de GitHub",
    "ariaLabelTelegram": "Ir al perfil de Telegram",
    "contact": "contacto",
    "getInTouch": "Ponte en contacto",
    "textContact": "Si estás interesado en colaborar, no dudes en ponerte en contacto a través de este formulario. Siempre estoy dispuesto a discutir nuevos proyectos, ideas creativas u oportunidades para formar parte de tus visiones.",
    "sendMessageSuccess": "Mensaje enviado con éxito",
    "sendMessageError": "No se pudo enviar el mensaje. Por favor, inténtalo de nuevo más tarde.",
    "wantCollaboration": "¿Quieres colaborar?",
    "name": "Nombre",
    "message": "Mensaje",
    "submit": "Enviar",
    "submitAriaLabel": "Envía el formulario y el mensaje."
  },
  "Header": {
    "main": "Principal",
    "about": "Sobre mi",
    "projects": "Proyectos",
    "ariaLabelMain": "Ir a la página principal",
    "ariaLabelAbout": "Ir a la página de información / sobre mí",
    "ariaLabelProjects": "Ir a la página de proyectos",
    "closeModalAriaLabel": "Cerrar el menú móvil"
  },
  "Footer": {
    "slogan": "Creando experiencias digitales, una línea de código a la vez.",
    "contactFooter": "Contacto",
    "address": "Madrid, España",
    "callUs": "Llámanos al +34 665 051 466",
    "sendEmail": "Envía un mensaje a mi correo electrónico: vladtwince@gmail.com"
  },
  "AboutMe": {
    "subtitle": "Sobre Mí",
    "title": "Todo Sobre Mí",
    "description": "Sobre mis habilidades, mi formación, mi experiencia, mis pasatiempos y mi vida.",
    "shape":"Forma para decoración",
    "myPhoto":"Mi foto",
    "skills":"Habilidades",
    "techSkills":"Habilidades Técnicas:",
    "skillsValues":"HTML5, CSS3, JavaScript, TypeScript, React.js, Redux, Redux Toolkit, Next.js, Tailwind CSS, SCSS, Styled-Components, Framer-motion, Material UI, Sanity, Stripe, Node.js, Express.js, React Native (Expo), bases de datos SQL/NoSQL, Firebase, JQuery, Swagger, WordPress, AWS Cloud, i18next, y bibliotecas JS/React.",
    "soft":"Soft:",
    "softValues":"VSCode, Git, GitHub, Figma, Trello, Jira, Slack, Zoom, Postman, Swagger, Squooash, Chrome Devtools, Mongo Atlas, Heroku, Vercel, Netlify",
    "approaches":"Enfoques:",
    "approachesValues":"Mobile First, Diseño Responsivo, Compatibilidad entre navegadores, Pixel Perfect, Optimización SEO, Accesibilidad, SCRUM, Agile, Autenticación JWT, Animación, REST API.",
    "banner":"Banner de mi perfil de LinkedIn",
    "seamanLife":"Vida de Marinero",
    "textSeaman1":"Desde 2008 hasta 2014 fui estudiante en la Academia Nacional Marítima de Odesa (ahora llamada Universidad Nacional Academia Marítima de Odesa), donde estudié para convertirme en navegante marítimo. Durante mi formación, comencé mi carrera como marinero en barcos internacionales. Mi primer viaje lo realicé en 2011 en un carguero como Cadete de Cubierta. En febrero de 2014, me gradué como Especialista en Navegación (Máster).",
    "textSeaman2":"Desde 2017, me convertí en Tercer Oficial y hasta agosto de 2022 trabajé en esa posición, mientras pensaba en nuevas oportunidades en mi vida, como el Desarrollo Web.",
    "onmaSymbol":"Símbolo de la Universidad Nacional Academia Marítima de Odesa"
  }
}
