{
  "HomePage": {
    "heroSubtitle": "portafolio",
    "title": "Hola, Soy Vlad Vagin",
    "textHero": "Desarrollador web frontend y MERN-stack especializado en HTML5/CSS3, JavaScript, React.js, Next.js, TypeScript, Node.js, bases de datos NoSQL/SQL, APIs REST y WordPress.",
    "btnAbout": "Sobre mi",
    "btnDownload": "Descargar CV",
    "expertise": "Mi especialidad",
    "solutions": "Soluciones Innovadoras",
    "textExpertise": "Me especializo en crear páginas web y aplicaciones dinámicas y atractivas. Tengo amplia experiencia en el desarrollo de APIs REST, implementando las mejores prácticas de SEO y accesibilidad. Mi objetivo es crear soluciones eficientes, escalables y fáciles de usar que satisfagan las necesidades de los usuarios.",
    "webpages": "Sitios Web",
    "textWebpages": "Implica crear páginas individuales que proporcionen información, entretenimiento o funcionalidad de comercio electrónico. Me aseguro de que estas páginas estén bien diseñadas, sean responsivas y estén optimizadas para motores de búsqueda.",
    "textWebapps": "Se trata de crear aplicaciones que se ejecutan en un servidor web y a las que los usuarios pueden acceder a través de un navegador web. Me especializo en crear aplicaciones web dinámicas, responsivas y fáciles de usar utilizando tecnologías modernas como JavaScript, TypeScript, React y Next.",
    "textRestApis": "Crear interfaces que permiten a diferentes aplicaciones de software comunicarse e intercambiar datos. Tengo experiencia en el diseño e implementación de APIs REST seguras, eficientes y escalables con Node.js",
    "skills": "Mis habilidades",
    "whatSkills":"Frontend, Backend y Software",
    "textSkills": "Me especializo en JavaScript, TypeScript, React, Next y tengo experiencia en desarrollo backend con Node.js. También soy competente en el uso de varias herramientas de desarrollo, como npm y Git, Redux y Firebase. Mi enfoque está en escribir código limpio, eficiente y mantenible.",
    "featuredWorks": "Trabajos Destacados",
    "seeMore": "Ver Más +",
    "shapeAlt": "Forma para decoración",
    "screenAlt": "Captura de pantalla del proyecto",
    "ariaLabelLink": "Enlace a la página de detalles del proyecto",
    "educationSubtitle": "mi aprendizaje",
    "educationTitle": "Formación",
    "educationText": "Mi trayectoria educativa ha sido única y diversa. Comencé mi carrera como marinero, navegando por los vastos océanos. Sin embargo, mi pasión por la tecnología y la programación me llevó al mundo del desarrollo web. Hoy en día, utilizo mis diversas experiencias para crear soluciones web innovadoras y fáciles de usar",
    "onma": "Universidad Nacional 'Academia Marítima de Odesa'",
    "textOnma": "Recibí mi Maestría en Navegación de la Academia Marítima de Odesa en 2014. Este riguroso programa me proporcionó una sólida base en principios y prácticas de navegación, y me inculcó una profunda apreciación por la precisión y la exactitud, cualidades que aplico en mi trabajo como desarrollador web.",
    "goit": "GoIT - Escuela de TI",
    "textGoit": "Completé un curso de 10 meses de Desarrollador Web Fullstack en GoIT. Aprendí a construir aplicaciones web utilizando una variedad de tecnologías, incluyendo HTML, CSS, JavaScript, TypeScript, React y Node.js. Estoy entusiasmado por seguir ampliando mis habilidades y conocimientos en este campo.",
    "getafe": "CRN Getafe",
    "textGetafe": "Completé un curso de 6 meses en Confección y Publicación de Páginas Web en CRN Getafe, con 80 horas de prácticas. Aprendí a construir páginas web utilizando una variedad de tecnologías, incluyendo HTML, CSS, JavaScript, JQuery, Bootstrap, WordPress, SEO y Accesibilidad. Estoy entusiasmado por seguir ampliando mis habilidades y conocimientos en este campo.",
    "socialMedia": "Redes Sociales",
    "textSocialMedia": "También puedes visitar mis perfiles en redes sociales como LinkedIn o GitHub, y contactarme a través de Telegram.",
    "ariaLabelLinkedIn": "Ir al perfil de LinkedIn",
    "ariaLabelGitHub": "Ir al perfil de GitHub",
    "ariaLabelTelegram": "Ir al perfil de Telegram",
    "contact": "contacto",
    "getInTouch": "Ponte en contacto",
    "textContact": "Si estás interesado en colaborar, no dudes en ponerte en contacto a través de este formulario. Siempre estoy dispuesto a discutir nuevos proyectos, ideas creativas u oportunidades para formar parte de tus visiones.",
    "sendMessageSuccess": "Mensaje enviado con éxito",
    "sendMessageError": "No se pudo enviar el mensaje. Por favor, inténtalo de nuevo más tarde.",
    "wantCollaboration": "¿Quieres colaborar?",
    "name": "Nombre",
    "message": "Mensaje",
    "submit": "Enviar",
    "submitAriaLabel": "Envía el formulario y el mensaje."
  },
  "Header": {
    "main": "Principal",
    "about": "Sobre mi",
    "projects": "Proyectos",
    "ariaLabelMain": "Ir a la página principal",
    "ariaLabelAbout": "Ir a la página de información / sobre mí",
    "ariaLabelProjects": "Ir a la página de proyectos",
    "closeModalAriaLabel": "Cerrar el menú móvil"
  },
  "Footer": {
    "slogan": "Creando experiencias digitales, una línea de código a la vez.",
    "contactFooter": "Contacto",
    "address": "Madrid, España",
    "callUs": "Llámanos al +34 665 051 466",
    "sendEmail": "Envía un mensaje a mi correo electrónico: vladtwince@gmail.com"
  },
  "AboutMe": {
    "subtitle": "Sobre Mí",
    "title": "Todo Sobre Mí",
    "description": "Sobre mis habilidades, mi formación, mi experiencia, mis pasatiempos y mi vida.",
    "shape": "Forma para decoración",
    "myPhoto": "Mi foto",
    "skills": "Habilidades",
    "techSkills": "Habilidades Técnicas:",
    "skillsValues": "HTML5, CSS3, JavaScript, TypeScript, React.js, Redux, Redux Toolkit, Next.js, Tailwind CSS, SCSS, Styled-Components, Framer-motion, Material UI, Sanity, Stripe, Node.js, Express.js, React Native (Expo), bases de datos SQL/NoSQL, Firebase, JQuery, Swagger, WordPress, AWS Cloud, i18next, y bibliotecas JS/React.",
    "soft": "Soft:",
    "softValues": "VSCode, Git, GitHub, Figma, Trello, Jira, Slack, Zoom, Postman, Swagger, Squooash, Chrome Devtools, Mongo Atlas, Heroku, Vercel, Netlify",
    "approaches": "Enfoques:",
    "approachesValues": "Mobile First, Diseño Responsivo, Compatibilidad entre navegadores, Pixel Perfect, Optimización SEO, Accesibilidad, SCRUM, Agile, Autenticación JWT, Animación, REST API.",
    "banner": "Banner de mi perfil de LinkedIn",
    "seamanLife": "Marinero",
    "textSeaman1": "Desde 2008 hasta 2014 fui estudiante en la Academia Nacional Marítima de Odesa (ahora llamada Universidad Nacional Academia Marítima de Odesa), donde estudié para convertirme en navegante marítimo. Durante mi formación, comencé mi carrera como marinero en barcos internacionales. Mi primer viaje lo realicé en 2011 en un carguero como Cadete de Cubierta. En febrero de 2014, me gradué como Especialista en Navegación (Máster).",
    "textSeaman2": "Desde 2017, me convertí en Tercer Oficial y hasta agosto de 2022 trabajé en esa posición, mientras pensaba en nuevas oportunidades en mi vida, como el Desarrollo Web.",
    "onmaSymbol": "Símbolo de la Universidad Nacional Academia Marítima de Odesa",
    "goit": "GoIT",
    "goitText1": "Después del inicio de la guerra en Ucrania, me trasladé a España con mi familia y comencé a aprender Desarrollo Web. Obtengo mi primer certificado en marzo de 2023 y fue el Certificado de AWS Cloud Practitioner.",
    "goitText2": "Después de eso, comencé un curso de 10 meses de Desarrollador Web Fullstack en la escuela GoIT. Durante este curso aprendí HTML5, CSS3, JavaScript, React.js, Redux, TypeScript y Node.js. Lo más importante es que aprendimos las mejores prácticas de codificación y las tecnologías más modernas. Participé en proyectos en equipo y en numerosos proyectos individuales. En nuestros proyectos en equipo utilizamos Trello, Jira, GitHub y Figma para el diseño. Fue una experiencia tan genial que completé el curso de 10 meses en 6 meses.",
    "goitText3": "También, durante mi educación, participé en el proyecto en equipo DrukArmy. Actualizamos la parte frontal de un proyecto existente utilizando Next.js. Fue una experiencia muy útil, ya que empecé a trabajar con Next.js, aprendí a implementar i18next para la localización, cómo personalizar los campos de entrada para todos los tipos de navegador y cómo trabajar con diseños complejos.",
    "certPage1": "Primera página del Certificado de Desarrollador Web Fullstack",
    "certPage2": "Segunda página del Certificado de Desarrollador Web Fullstack",
    "certPage3": "Tercera página del Certificado de Desarrollador Web Fullstack",
    "certPage4": "Cuarta página del Certificado de Desarrollador Web Fullstack",
    "getafe": "CRN Getafe",
    "getafeText1": "Después de mi traslado a España, comencé a aprender español y empecé un curso de Desarrollo y Publicación de Páginas Web en el Centro de Educación de Getafe. Durante este curso, aprendí HTML5, CSS3, JavaScript, JQuery, Bootstrap, WordPress (Elementor, WooCommerce), optimización SEO y accesibilidad. Tras completar este curso, realicé una pasantía de 80 horas (3 semanas) en la ONG Remar España.",
    "getafeText2": "La primera vez que trabajé con WordPress, optimicé el sitio web para SEO y solucioné errores de CSS y JS. Cuando mi tutor vio que podía crear aplicaciones web, me pidió que desarrollara una aplicación web para Solidaria Media. Elegí Next.js para este proyecto. Creé esta aplicación para la transmisión de radio y televisión con un panel de administración. El administrador puede gestionar los videos de YouTube en esta aplicación, añadiéndolos o eliminándolos.",
    "getafeText3": "Tras la finalización exitosa de esta pasantía, obtuve un certificado profesional y una calificación media en España.",
    "searchJob": "Buscando",
    "searchJobText1": "Después de completar los cursos en GoIT y CRN Getafe, continué aprendiendo nuevas tecnologías y mejorando mis habilidades. Aprendí React Native, bases de datos SQL, integraciones con Sanity y Stripe, mejoré TypeScript y, en este momento, estoy aprendiendo IA en Desarrollo Web. Mi educación nunca se detendrá, incluso si consigo un empleo.",
    "searchJobText2": "Debido a lo mencionado anteriormente, estoy buscando un empleo como Desarrollador Web Junior (Junior Fuerte). Estoy dispuesto a trabajar en equipo, aprender cosas nuevas y mejorar mis habilidades. Busco una empresa donde pueda crecer y desarrollar mis habilidades. Estoy interesado en formar parte de un equipo, trabajar en proyectos interesantes y en una cooperación a largo plazo. Además, estoy dispuesto a trasladarme a cualquier ciudad dentro de España.",
    "hobby": "Pasatiempos",
    "hobbyText": "Mi principal pasatiempo, por supuesto, es la programación. Pero también me gusta mucho hacer senderismo y tocar la guitarra. Me gusta pasar tiempo en la naturaleza, lejos del ruido de la ciudad. He estado tocando la guitarra durante más de 10 años. Me gusta tocar la guitarra porque me ayuda a relajarme y a olvidar todos los problemas.",
    "hobbyPhotoAlt": "Sierra de Guadarrama"
  },
  "Projects": {
    "details":"Detalles",
    "skills":"Habilidades",
    "approaches":"Enfoques",
    "description":"Descripción",
    "repo":"Repositorio",
    "type":"Tipo:",
    "subtitle": "portafolio",
    "title": "Mis Proyectos",
    "text": "Hay diferentes tipos de proyectos web, desde páginas de aterrizaje simples y galerías de imágenes hasta aplicaciones web completas con servidores de APIs REST.",
    "shape": "Forma para decoración",
    "imgAlt": "Desarrollo web de proyectos",
    "seeDetails":"Ver detalles",
    "seeMore":"Ver Más +",
    "btnAriaLabel":"Ir a los detalles del proyecto",
    "petloveDescription":"Una aplicación para buscar una nueva casa para mascotas y para personas que buscan un nuevo amigo adorable en sus vidas. La aplicación consta de 6 páginas públicas, 2 páginas privadas (con dos subpáginas: Favoritos y Vistos) y páginas para iniciar sesión y registrar usuarios. La aplicación tiene un diseño adaptable y está optimizada para dispositivos móviles. Utiliza una API REST para obtener datos del servidor. El usuario puede filtrar las mascotas por palabra clave, tipo, género, ubicación, categoría, popularidad y precio. Puede agregar mascotas a favoritos y verlas más tarde, contactar con el propietario y crear una tarjeta de mascota por sí mismo/a.",
    "petloveDetails":"Proyecto frontend individual en React y APIs REST. La aplicación tiene un diseño adaptable y está optimizada para dispositivos móviles. Utiliza tokens JWT para la autenticación. El usuario puede iniciar sesión y cambiar el avatar o la información del usuario. Además, cuando el usuario está autorizado, puede crear una tarjeta de mascota, agregarla a favoritos y contactar con el propietario de la mascota. La aplicación también tiene una pantalla de inicio (Splash screen). Para el selector de fechas (DatePicker) utilizo la biblioteca Material UI, y para los selectores de entrada (input-select) utilizo la biblioteca React-Select. También hay un filtro para las mascotas por palabra clave, categoría, tipo, ubicación, género, popularidad y precio. Todas las imágenes están en formato webp para optimización. Para la validación de formularios utilizo las bibliotecas Formik, React-Hook-Form y Yup, debido a los requisitos técnicos. Para las notificaciones utilizo la biblioteca React-toastify. Para obtener datos del servidor utilizo la biblioteca Axios. Para el estilizado utilizo la biblioteca Styled-components. Para la gestión del estado utilizo la biblioteca Redux Toolkit. Para persistir el estado utilizo la biblioteca Redux Persist. En la página de Noticias, el usuario puede leer noticias sobre animales y filtrarlas por palabra clave.",
    "lingoDescription":"Una aplicación para una empresa que ofrece servicios de profesores de idiomas en línea. Después de iniciar sesión, el usuario puede contactar con el profesor y agregarlo a favoritos. El usuario puede filtrar a los profesores por idioma, precio y nivel de conocimiento. También puede ver el perfil del profesor y consultar su calificación, precio, disponibilidad, idiomas y descripción.",
    "lingoDetails":"Proyecto fullstack individual en React y Firebase. La aplicación tiene un diseño adaptable, está optimizada para dispositivos móviles y utiliza Firebase-Auth y Real-Time Database. El usuario puede cambiar el color de acento y elegir lo que le guste. Para contactar con el profesor y/o agregarlo a Favoritos, el usuario debe iniciar sesión en la aplicación. La aplicación web utiliza animaciones en CSS, paginación y filtrado por precio, idioma y nivel.",
    "ecoSolutionDescription":"Una página de aterrizaje para una empresa que ofrece soluciones ecológicas. La aplicación tiene un diseño adaptable y está optimizada para dispositivos móviles.",
    "ecoSolutionDetails":"Proyecto individual de página de aterrizaje en React.js. Fue una tarea de prueba que completé. Esta página de aterrizaje utiliza la biblioteca react-scroll para la navegación y framer-motion para la animación. Tiene un slider personalizado y validación de formularios. Para la validación de formularios utilizo las bibliotecas react-hook-form y Yup. Para el estilizado utilizo Styled-Components.",
    "epharmDescription":"Panel de administración para tiendas de e-farmacia. El administrador debe iniciar sesión primero y, después de eso, podrá consultar todos los datos, crear nuevos productos, proveedores, editarlos, eliminarlos y filtrarlos.",
    "epharmDetails":"Proyecto fullstack individual en React.js y API REST (Node.js, Express.js, MongoDB). Este es un panel de administración para una farmacia que incluye estadísticas, información de clientes, proveedores, pedidos y productos. Hay filtros, paginación y desplazamiento horizontal para las tablas. Para la autenticación del administrador utilizo tokens JWT.",
    "apiPharmDescription":"Backend para el proyecto de e-farmacia para administradores. Tiene autenticación JWT con rutas privadas y documentación Swagger.",
    "apiPharmDetails":"Este proyecto de backend es parte del proyecto fullstack individual E-Pharmacy. El backend tiene rutas para obtener y editar información sobre clientes, productos, pedidos y proveedores. Utiliza bcrypt para el hashing de contraseñas. Para la validación de datos utilizo la biblioteca Joi. Para la autenticación utilizo tokens JWT. Para la documentación utilizo Swagger. La base de datos es MongoDB.",
    "solidariaDescription":"Aplicación para la transmisión de radio y televisión para la ONG Remar España. El administrador puede añadir o eliminar los últimos videos de los canales de YouTube de Solidaria Media. El backend y el frontend se crearon con Next.js",
    "solidariaDetails":"Proyecto fullstack individual en Next.js y base de datos MongoDB. Diseño y estructura libres. Esta aplicación fue creada durante mi pasantía, especialmente para la ONG REMAR España para la transmisión de radio y televisión. También incluye los últimos videos de los canales de YouTube de Solidaria Media. El administrador puede añadir nuevos videos o eliminar videos antiguos de la aplicación. Para la API utilizo SSC de Next.js y Credentials Provider",
    "drukarmyDescription":"Rediseño del sitio web existente para la organización voluntaria ucraniana DrukArmy.",
    "drukarmyDetails":"DrukArmy es un famoso proyecto voluntario ucraniano. Fue un proyecto en equipo de Frontend para rediseñar la parte frontal de la aplicación web existente. Utilizamos Next.js para optimizar el SEO. Para el estilizado usamos CSS-modules. Mis secciones fueron: Encabezado, Pie de página, Página principal, Página de Términos, Página de Error 404, Cargador, Interruptor de Modo Oscuro/Claro, Internacionalización con i18next, Menú móvil y todos los modales en la Página principal.",
    "drinkFrontDescription":"DrinkMaster es una aplicación de recetas de cócteles. El usuario debe registrarse e iniciar sesión primero. Luego, puede añadir cócteles a favoritos y crear bebidas personalizadas. Además, el usuario puede cambiar el avatar y algunos datos de usuario. Mis secciones: Encabezado, Menú móvil, Interruptor de modo oscuro/claro, Navegación, Bebidas populares, Menú de usuario, Modal de actualización de usuario con formulario.",
    "drinkFrontDetails":"Proyecto fullstack en equipo con React.js y Node.js. La aplicación tiene un diseño adaptable y está optimizada para dispositivos móviles. Mi sección incluye: Encabezado, Menú móvil, Interruptor de modo oscuro/claro, Bebidas populares, Menú de perfil de usuario, Modal con formulario de actualización de usuario. En el backend, se crearon rutas para Bebidas populares, Actualización de usuario y documentación Swagger para ellas. Primero creamos el backend y luego la parte frontend. El usuario puede cambiar el avatar, crear bebidas personalizadas, añadir a Favoritos y eliminar de Favoritos. La aplicación incluye filtros, paginación y cursor personalizado. Para la autenticación usamos tokens JWT y verificación por correo electrónico.",
    "apiDrinkDescription":"Backend para el proyecto DrinkMaster. Cuenta con autenticación JWT con rutas privadas y documentación Swagger.",
    "apiDrinkDetails":"Backend para el proyecto en equipo DrinkMaster. Mis secciones en el backend fueron: ruta para obtener Bebidas Populares, ruta para actualizar Usuario (cambiar avatar, información) y documentación Swagger para estas rutas.",
    "bookshelfDescription":"Bookshelf es un sitio web para amantes de los libros. El usuario también puede añadir libros a favoritos y verlos más tarde. La aplicación utiliza Firebase para la autenticación y el almacenamiento de datos. Mis secciones: Encabezado, Libros más vendidos, Autenticación con Firebase, Paginación, Interruptor de modo oscuro/claro, Lista de categorías.",
    "bookshelfDetails":"Proyecto Frontend en equipo en JavaScript puro con Autenticación de Firebase. Mis secciones fueron: Libros más vendidos, Libros por categorías, Encabezado, Interruptor de modo oscuro/claro, Menú móvil, Autenticación con Firebase y Eliminación de libros de Favoritos. Para este proyecto en equipo usamos el empaquetador Vite. También hay Paginación y Filtrado por categorías. Para el estilizado utilizamos CSS3. Para el modal de Detalles del libro usamos la biblioteca Simplelightbox.",
    "energyDescription":"Aplicación para ejercicios de entrenamiento. El usuario puede filtrar los ejercicios por categoría, nivel y equipo. También puede ver los detalles del ejercicio y añadirlo a favoritos.",
    "energyDetails":"Proyecto frontend individual en JavaScript puro y API REST. El usuario puede filtrar ejercicios por palabra clave. También puede ver los detalles del ejercicio y añadirlo a favoritos. Para este proyecto utilicé el empaquetador Parcel. Incluye paginación y filtrado por categoría, nivel y equipo. Para el estilizado utilicé CSS3.",
    "hotelDescription":"Sistema de gestión hotelera con panel de administración en Sanity Studio. El administrador puede añadir, editar, eliminar habitaciones, ver reservas, ver estadísticas y gestionar usuarios, reservas, habitaciones y reseñas. El usuario puede reservar una habitación, ver los detalles de la reserva, pagar por la habitación, dejar una reseña de la habitación y consultar las estadísticas en el menú del usuario.",
    "hotelDetails":"Proyecto fullstack individual en Next.js, TypeScript, Stripe y Tailwind CSS. Para el panel de administración utilicé Sanity Studio. El usuario puede iniciar sesión con Google, GitHub o credenciales y reservar una habitación en las fechas elegidas. El usuario puede realizar el pago con tarjeta, dejar una reseña y consultar las estadísticas desde el perfil de usuario. También hay un interruptor de modo oscuro/claro. Desde Sanity Studio, el administrador puede añadir habitaciones, gestionar habitaciones, usuarios, reservas y reseñas. El administrador puede ver las estadísticas de reservas y reseñas.",
    "focusDescription":"Págína de aterrizaje para la escuela de fotografía Focus.Frame.",
    "focusDetails":"Proyecto en equipo de página de aterrizaje para el curso de HTML/CSS. Mis secciones: Hero, Sobre nosotros, Publicidad, Menú móvil, Pie de página. HTML semántico, sprites SVG, validación de formularios, slider y animación están presentes en este proyecto. Focus.Frame es una escuela de fotografía.",
    "webstudioDescription":"Págína de aterrizaje de un Estudio Web. Proyecto individual del curso de HTML/CSS.",
    "webstudioDetails":"Proyecto individual del curso de HTML/CSS. Incluye sliders, formulario de pedido y superposición de tarjetas. Todo el proyecto fue creado con HTML5, CSS3 y JavaScript para los modales.",
    "chocoDescription":"Págína de aterrizaje de Simply Chocolate. Proyecto individual del curso de HTML/CSS. Incluye sliders, formulario de reseñas e imitación de carrito de compras.",
    "chocoDetails":"Proyecto individual de página de aterrizaje del curso de HTML/CSS. Incluye sliders, formulario de reseñas e imitación de carrito de compras. Todo el proyecto fue creado con HTML5, CSS3 y JavaScript para modales, carrito de compras y animaciones."
  }
}
